[
    {
        "title": "Exports of the Isabelle library and the archive of formal proof on MathHub.info",
        "id": "2018-10-10-isabelle",
        "date": 1539147600,
        "teaser": "<p>Makarius Wenzel has just completed an export of the theories in the <a href=\"https://isabelle.in.tum.de/\">Isabelle distribution</a> and  the <a href=\"https://www.isa-afp.org/\">Archive of Formal Proof</a> in OMDoc/MMT. They are at http://gl.mathhub.info/Isabelle and will be updated regularly as the sources evolve.</p>\n",
        "content": "<p>Makarius Wenzel has just completed an export of the theories in the <a href=\"https://isabelle.in.tum.de/\">Isabelle distribution</a> and  the <a href=\"https://www.isa-afp.org/\">Archive of Formal Proof</a> in OMDoc/MMT. They are at http://gl.mathhub.info/Isabelle and will be updated regularly as the sources evolve.</p>\n"
    },
    {
        "title": "First (marginally functional) prototype on new.MathHub.info",
        "id": "2018-07-01-first-new",
        "date": 1530421200,
        "content": "<p>We have a first marginally functional prototype on http://new.mathhub.info. The docker swarm that constitutes the MathHub back-end (see the <a href=\"https://github.com/MathHubInfo/MathHub\">documentation</a>) is functional and the MMT generates JSON content reports, which are picked up by a <a href=\"http://github.com/MathHubInfo/FrontEnd\">Front-end</a> based on [React.JS]{https://reactjs.org).</p>\n\n<p>Once this setup reaches rough feature parity with the old MathHub portal we will switch over.</p>\n"
    },
    {
        "title": "Reimplementing MathHub.info without Drupal",
        "id": "2018-04-12-reimplementing",
        "date": 1523509200,
        "content": "<p>We have decided that we will not invest into re-building the compromised Drupal installation of the MathHub.info front-end, but instead re-implement MathHub.info using docker, webpack, and React.JS.</p>\n\n<p>We have retired the old Mathhub server to the local network (http://http://10.188.48.202/) for reference and copying and have started to set up the new architecture at http://github.com/MathHubInfo. The development server will be available at http://new.mathhub.info.</p>\n\n"
    },
    {
        "title": "MathHub.info hacked; offline",
        "id": "2018-04-10-hacked",
        "date": 1523336400,
        "content": "<p>The server that runs MathHub.info has been hacked again using an outdated and thus vulnerable Drupal installation as an entry point. We have taken the server offline and are deciding how to best deal with the situation.</p>\n"
    },
    {
        "title": "Theory Graph Viewer in MathHub",
        "id": "2017-06-11-tgview",
        "date": 1497157200,
        "content": "<p>We have added a theory graph viewer to MathHub.\nTGView is available at https://mathhub.info/mh/mmt/graphs/tgview.html and can present arbitrary theory graphs whose graph data is generated by MMT.\nFor instance, the Math-in-the-Middle ontology can be seen as https://mathhub.info/mh/mmt/graphs/tgview.html?type=pgraph&amp;graphdata=htt…\nDetails can be found in a <a href=\"http://kwarc.info/kohlhase/submit/mathui17-tgview.pdf\">paper submitted to MathUI 2017</a>.</p>\n"
    },
    {
        "title": "Starting the Math-in-the-Middle Ontology on MathHub",
        "id": "2017-01-28-MitM-ontology",
        "date": 1485583200,
        "content": "<p>The Math-in-the-Middle (MitM) Ontology is a concept from the <a href=\"http://opendreamkit.org\">OpenDreamKit Project</a>. It is intended as a curated set mathematical concepts that serve as a platonic concept space that can be used to make mathematical software systems interoperable (WP6 in OpenDreamKit). We have to start at some point with curating materials for the MitM ontology, and we already have a (small) amount of <a href=\"http://mathhub.info/MitM\">seed content</a>.</p>\n\n"
    },
    {
        "title": "MathHub.info has news",
        "id": "2016-10-11-news",
        "date": 1476162000,
        "content": "<p>We finally have a news feature for announcements, we will try to keep you posted on the developments in the system:</p>\n\n<ul>\n  <li>new libraries or major updates to existing ones</li>\n  <li>new services/applications hosted on MathHub.info</li>\n  <li>new features of the backend accessible by API</li>\n</ul>\n\n<p>Atom/RSS feeds for this news channel will be available at a later time.\nAny news items before this announcements are actually “olds”: news items published after the fact to document the developement of the system.</p>\n"
    },
    {
        "title": "Hello World Repositories on MathHub",
        "id": "2016-02-16-hello_world",
        "date": 1455602400,
        "content": "<p>To make the creation of content on <a href=\"http://mathhub.info\">MathHub.info</a> simpler for beginners, we have developed a set of <a href=\"http://mathhub.info/HelloWorld\">Hello World Examples</a> for SMGloM, sTeX-based course materials, problems, and exams, and MMT. To make a new math archive the closest Hello World repository can just be forked and built upon.</p>\n"
    },
    {
        "title": "Five more theorem prover libraries: Coq, HOL4, TPS, Hol Light, and Isabelle",
        "id": "2016-01-15-libraries",
        "date": 1452837600,
        "content": "<p>In the <a href=\"http://kwarc.info/projects/OAF\">DFG OAF project</a> we build translations from theorem prover libraries to OMDoc/MMT and host them on MathHub for management. We have started working on</p>\n\n<ul>\n  <li><a href=\"http://gl.mathhub.info/HOL4\">HOL4</a></li>\n  <li><a href=\"http://gl.mathhub.info/HOLLight\">HOL Light</a></li>\n  <li><a href=\"http://gl.mathhub.info/TPS\">TPS</a></li>\n  <li><a href=\"http://gl.mathhub.info/Coq\">Coq</a></li>\n</ul>\n\n"
    },
    {
        "title": "Odk_cds",
        "id": "2015-12-08-ODK_CDs",
        "date": 1449554400,
        "content": "<p>The <a href=\"http://opendreamkit.org\">OpenDreamKit Project</a> (ODK) funded by the European Union has started in September. <a href=\"http://kwarc.info\">KWARC</a> is responsible for WP6, which tries to make ODK systems interoperable by connecting them via a “Math-in-the-Middle Ontology” of content dictionaries (OMDoc/MMT theories really) generated from the systems as interfaces. We are hosting these on MathHub naturally. They are at http://mathhub.info/ODK.</p>\n"
    },
    {
        "title": "Specware on MathHub",
        "id": "2015-04-10-specware",
        "date": 1428642000,
        "content": "<p>The (public parts) of the <a href=\"http://www.kestrel.edu/home/prototypes/specware.html\">Specware libary</a> developed at the Kestrel Institute have been translated into OMDoc/MMT by Florian Rabe.</p>\n\n"
    },
    {
        "title": "PVS library on MathHub",
        "id": "2015-03-27-pvs",
        "date": 1427432400,
        "content": "<p>The <a href=\"http://mathhub.info/PVS/\">PVS library</a> is now hosted on MathHub. It contains the most important developments in the\n<a href=\"http://pvs.csl.sri.com/\">PVS</a> theorem prover. Dennis Müller is working on the translation into OMDoc/MMT it can be found at http://mathhub.info/PVS.</p>\n\n"
    },
    {
        "title": "TPTP library on MathHub",
        "id": "2015-01-10-tptp",
        "date": 1420869600,
        "content": "<p>The <a href=\"http://www.tptp.org/\">TPTP library</a> has been translated to OMDoc/MMT and is hosted on MathHub. No front-end available yet.</p>\n"
    },
    {
        "title": "Reorganized metadata handling and help in MathHub.info",
        "id": "2014-12-20-metadata",
        "date": 1419055200,
        "content": "<p>We have reorganized the way metadata is handled in MathHub.info. Much of the documentation and metadata is moved into the repositories, either into the<code class=\"highlighter-rouge\">META-INF</code> subdirs in the math archives or into the <code class=\"highlighter-rouge\">meta-inf</code> repositories of the libraries. This gives rise to a much more persistent and scalable architecture.</p>\n"
    },
    {
        "title": "The Online Encyclopedia of Integer Sequences (OEIS) archived on MathHub",
        "id": "2014-12-18-OEIS",
        "date": 1418882400,
        "content": "<p>The database of the <a href=\"http://oeis.org/\">Encyclopedia of Integer Sequences</a> has been converted to OMDoc/MMT and is now hosted on MathHub. We do not have a public front-end so that we do not deflect traffic from http://oeis.org.</p>\n"
    },
    {
        "title": "MMT libraries hosted on MathHub",
        "id": "2014-02-21-MMT",
        "date": 1392962400,
        "content": "<p>The <a href=\"https://mathhub.info/MMT\">MMT library</a> is hosted on MathHub, it contains a couple of logical foundations, a logic atlas and a small development of domain theories expressed OMDoc/MMT.</p>\n"
    },
    {
        "title": "Mizar Mathematical Library on MathHub",
        "id": "2014-02-18-mizar",
        "date": 1392703200,
        "content": "<p>The <a href=\"https://mathhub.info/Mizar\">Mizar Mathematical Library</a> is hosted on MathHub, it contains ca. 50.000 definitions, theorems, and proofs from the <a href=\"http://mizar.org/\">Mizar</a> project in OMDoc/MMT.</p>\n"
    },
    {
        "title": "MiKoMH library for flexiformal course materials",
        "id": "2013-12-14-mikomh",
        "date": 1387000800,
        "content": "<p>The <a href=\"http://mathhub.info/MiKoMH\">MiKoMH library</a> is now hosted on MathHub, it contains the course materials (slides and course notes) of six courses and scientific talks flexiformally preloaded in <a href=\"http://github.com/KWARC/sTeX\">sTeX</a>. Problems and exams in sTeX also exist on MathHub but are private.</p>\n"
    },
    {
        "title": "SMGloM library hosted on MathHub",
        "id": "2013-11-13-smglom",
        "date": 1384322400,
        "content": "<p>The <a href=\"http://mathhub.info/SMGloM\">SMGLoM library</a> is hosted on MathHub, it contains a semantic, multilingual terminology for mahtematics.</p>\n"
    },
    {
        "title": "MathHub.info is online",
        "id": "2013-05-29-online",
        "date": 1369803600,
        "content": "<p>The MathHub system is online, it is intended both as</p>\n\n<ul>\n  <li>an archive of flexiformal documents and libraries of mathematical knowledge -ranging from fully formal developents to informal documents)</li>\n  <li>a portal for active mathematical documents based on these</li>\n</ul>\n\n<p>The archive aspect is realized using GIT repositories in http://gl.mathhub.info, a <a href=\"http://gitlab.com\">GitLab</a> instance serving and administering the repositories. The flexiformal documents and libraries are represented in the <a href=\"http://omdoc.org\">OMDoc</a> format and activated by the <a href=\"http://uniformal.github.io\">MMT</a>. A <a href=\"http://drupal.org\">Drupal</a>-based front-end combines these two and manages user functions.</p>\n"
    }
]